In [1]:
import pandas as pd
import numpy as np

etudiants = pd.DataFrame({
    'Nom': ['Alice', 'Bob', 'Charles', 'David', 'Emma', 'Fatou', 'Greg'],
    'Age': [23, 25, 22, 24, np.nan, 23, 26],
    'Note': [14.5, 12.0, 13.0, np.nan, 16.0, 18.0, np.nan],
    'Spécialité': ['Maths', 'Physique', 'Info', 'Maths', 'Info', 'Physique', 'Info']
})
df = pd.DataFrame(etudiants)

Affiche les premières lignes du DataFrame

In [5]:
etudiants.head()

       Nom   Age  Note Spécialité
0    Alice  23.0  14.5      Maths
1      Bob  25.0  12.0   Physique
2  Charles  22.0  13.0       Info
3    David  24.0   NaN      Maths
4     Emma   NaN  16.0       Info

Affiche uniquement les colonnes Nom et Note

In [6]:
df[['Nom', 'Note']]

       Nom  Note
0    Alice  14.5
1      Bob  12.0
2  Charles  13.0
3    David   NaN
4     Emma  16.0
5    Fatou  18.0
6     Greg   NaN

Affiche les étudiants de la spécialité “Info”

In [21]:
etudiants[etudiants['Spécialité'] == 'Info']
# etudiants.loc[etudiants['Spécialité'] == 'Info', 'Nom'] #avec les noms

       Nom   Age  Note Spécialité
2  Charles  22.0  13.0       Info
4     Emma   NaN  16.0       Info
6     Greg  26.0   NaN       Info

Quels sont les étudiants qui ont une note ≥ 14 ?

In [ ]:
etudiants[etudiants['Note'] >= 14]
# etudiants.loc[etudiants['Note'] >= 14, 'Nom'] #avec les noms

     Nom   Age  Note Spécialité
0  Alice  23.0  14.5      Maths
4   Emma   NaN  16.0       Info
5  Fatou  23.0  18.0   Physique

Quelle est la moyenne des notes ? (en ignorant les NaN)

In [26]:
# etudiants[etudiants['Note']].mean()

In [38]:

etudiants['Note'].mean()
# etudiants['Note'].mean(skipna=True) #meme chose
# etudiants['Note'].mean(skipna=False) #erreur car il y a des NaN

np.float64(14.7)

Remplace les notes manquantes par la moyenne

In [40]:
moyenne_note = etudiants['Note'].mean()
etudiants['Note'] = etudiants['Note'].fillna(moyenne_note)

etudiants['Note']

0    14.5
1    12.0
2    13.0
3    14.7
4    16.0
5    18.0
6    14.7
Name: Note, dtype: float64

Ajoute une colonne Mention :
"Bien" si note ≥ 14

"Passable" si note < 14

"Inconnu" si note était NaN à l’origine

In [46]:
def mention(note):
    if pd.isna(note):
        return 'Inconnu'
    elif note >= 14:
        return 'Bien'
    else:
        return 'Passable'

etudiants['Mention'] = etudiants['Note'].apply(mention)
etudiants[['Nom', 'Note', 'Mention']]

       Nom  Note   Mention
0    Alice  14.5      Bien
1      Bob  12.0  Passable
2  Charles  13.0  Passable
3    David  14.7      Bien
4     Emma  16.0      Bien
5    Fatou  18.0      Bien
6     Greg  14.7      Bien

Trie les étudiants par note décroissante

In [48]:
tri = etudiants.sort_values(by='Note', ascending=False)
tri

       Nom   Age  Note Spécialité   Mention
5    Fatou  23.0  18.0   Physique      Bien
4     Emma   NaN  16.0       Info      Bien
3    David  24.0  14.7      Maths      Bien
6     Greg  26.0  14.7       Info      Bien
0    Alice  23.0  14.5      Maths      Bien
2  Charles  22.0  13.0       Info  Passable
1      Bob  25.0  12.0   Physique  Passable

 Supprime les étudiants sans âge renseigné

In [54]:
etudiants_sans_age = etudiants.dropna(subset=['Age'])

etudiants_sans_age[['Nom', 'Age']]

       Nom   Age
0    Alice  23.0
1      Bob  25.0
2  Charles  22.0
3    David  24.0
5    Fatou  23.0
6     Greg  26.0

Groupe les étudiants par spécialité et donne la moyenne des notes

In [ ]:
etudiants.groupby('Spécialité')['Note'].mean()
# etudiants.groupby('Spécialité').agg({'Note': 'mean', 'Age': 'mean'})--> #moyenne des notes et des ages par spécialité

Spécialité
Info        14.566667
Maths       14.600000
Physique    15.000000
Name: Note, dtype: float64